src/zuul/single_test.org
#+TITLE: 单节点网关测试
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/main.css" />
#+HTML_LINK_UP: zuul_test.html   
#+HTML_LINK_HOME: zuul_test.html
#+OPTIONS: num:nil timestamp:nil 

*  测试环境
+ 主机：172.25.17.74
+ 硬件：8核16G内存
+ 部署：网关，auth服务，api-key服务，portal-service等服务，内存消耗在6G左右

* hello world服务测试
** 网关自身提供hello world服务
   #+BEGIN_SRC sh
     ab -t 100 -c 1 http://172.25.17.74:7070/hw 
     ab -t 100 -c 2 http://172.25.17.74:7070/hw 
     ab -t 100 -c 4 http://172.25.17.74:7070/hw 
     ab -t 100 -c 8 http://172.25.17.74:7070/hw 
     ab -t 100 -c 16 http://172.25.17.74:7070/hw
     ab -t 100 -c 32 http://172.25.17.74:7070/hw
     ab -t 100 -c 64 http://172.25.17.74:7070/hw
     ab -t 100 -c 128 http://172.25.17.74:7070/hw
     ab -t 100 -c 256 http://172.25.17.74:7070/hw
   #+END_SRC
   
   #+CAPTION: 网关自身提供hello world服务
   #+ATTR_HTML: :border 1 :rules all :frame boader
   | 指标                      |  1并发 |  2并发 |  4并发 |  8并发 | 16并发 | 32并发 | 64 并发 | 128并发 | 256并发 |
   | 发送总请求数              |  21161 |  36094 |  41150 |  41831 |  41700 |  41612 |   41564 |   41418 |   41299 |
   | 总时间(s)                 |    100 |    100 |    100 |    100 |    100 |    100 |     100 |     100 |     100 |
   | 平均请求时间(ms)          |  4.726 |  5.541 |  9.722 | 19.125 | 38.381 | 76.901 | 153.980 | 309.110 | 619.883 |
   | 请求时间中位数（50%<)(ms) |      4 |      4 |      6 |     12 |     28 |     83 |     149 |     326 |     639 |
   | 请求时间90%< (ms)         |      4 |      6 |     11 |     51 |     75 |    122 |     270 |     519 |     938 |
   | 最大请求时间(ms)          |   1037 |   1037 |   1044 |   1064 |   1083 |   1153 |    1257 |    1556 |    2205 |
   | Error                     |      0 |      0 |      0 |      0 |      0 |      0 |       0 |       0 |       0 |
   | QPS(请求数/秒)            | 211.61 | 360.94 | 411.50 | 418.31 | 416.87 | 416.12 |  415.64 |  414.18 |  412.99 |
   
   并发上不去的原因在于：高并发下日志打印太慢
   #+CAPTION: 修改打印日志级别后
   #+ATTR_HTML: :border 1 :rules all :frame boader
   | 指标                      |  1并发 |  2并发 |  4并发 |  8并发 |  16并发 |  32并发 | 64 并发 | 128并发 | 256并发 |
   | 发送总请求数              |  23907 |  47744 |  50000 |  50000 |   50000 |   50000 |   50000 |   50000 |   50000 |
   | 总时间(s)                 |    100 |    100 | 54.205 | 65.171 |  42.477 |  26.819 |  23.859 |  23.820 |  23.424 |
   | 平均请求时间(ms)          |  4.190 |  4.189 |  4.336 | 10.427 |  13.593 |  17.164 |  30.540 |  60.978 | 119.929 |
   | 请求时间中位数（50%<)(ms) |      3 |      3 |      3 |      4 |       6 |      10 |      13 |      20 |      49 |
   | 请求时间90%< (ms)         |      6 |      6 |      6 |     11 |      41 |      35 |      75 |     159 |     190 |
   | 最大请求时间(ms)          |   1040 |   1037 |   1033 |   1074 |    1038 |    1070 |    1100 |    2099 |    1672 |
   | Error                     |      0 |      0 |      0 |      0 |       0 |       0 |       0 |       0 |       0 |
   | QPS                       | 238.69 | 477.44 | 922.43 | 767.22 | 1177.10 | 1864.35 | 2095.63 | 2099.10 | 2134.60 |
   
