html/zuul/single_test.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>单节点网关测试</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Wu, Shanliang" />

<link rel="stylesheet" type="text/css" href="css/main.css" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="zuul_test.html"> UP </a>
 |
 <a accesskey="H" href="zuul_test.html"> HOME </a>
</div><div id="content">
<h1 class="title">单节点网关测试</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">测试环境</a></li>
<li><a href="#sec-2">hello world服务测试</a>
<ul>
<li><a href="#sec-2-1">网关自身提供hello world服务</a></li>
<li><a href="#sec-2-2">自动注册应用提供hello world服务，无auth认证</a></li>
<li><a href="#sec-2-3">自动注册应用提供hello world服务，oauth认证</a></li>
<li><a href="#sec-2-4">数据库精确匹配路由hello world服务, 无auth认证</a></li>
<li><a href="#sec-2-5">数据库精确匹配路由hello world服务, 缓存Oauth认证结果</a></li>
<li><a href="#sec-2-6">数据库模糊路径匹配路由hello world服务, 无安全认证</a></li>
<li><a href="#sec-2-7">数据库模糊路径匹配路由hello world服务, 缓存Oauth认证结果</a></li>
</ul>
</li>
<li><a href="#sec-3">业务应用测试</a>
<ul>
<li><a href="#sec-3-1">直接调用后台/portal/products</a></li>
<li><a href="#sec-3-2">网关优化前调用/portal/products</a></li>
<li><a href="#sec-3-3">网关优化后调用/portal/products</a></li>
</ul>
</li>
<li><a href="#sec-4">单节点测试总结</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">测试环境</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>主机：172.25.17.74
</li>
<li>硬件：8核16G内存
</li>
<li>部署：网关，auth服务，api-key服务，portal-service等服务，内存消耗在6G左右
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">hello world服务测试</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">网关自身提供hello world服务</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-sh">ab -t 100 -c 1 http://172.25.17.74:7070/hw 
ab -t 100 -c 2 http://172.25.17.74:7070/hw 
ab -t 100 -c 4 http://172.25.17.74:7070/hw 
ab -t 100 -c 8 http://172.25.17.74:7070/hw 
ab -t 100 -c 16 http://172.25.17.74:7070/hw
ab -t 100 -c 32 http://172.25.17.74:7070/hw
ab -t 100 -c 64 http://172.25.17.74:7070/hw
ab -t 100 -c 128 http://172.25.17.74:7070/hw
ab -t 100 -c 256 http://172.25.17.74:7070/hw
</pre>
</div>

<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">
<caption class="t-above"><span class="table-number">Table 1:</span> 网关自身提供hello world服务</caption>

<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="left">指标</td>
<td class="right">1并发</td>
<td class="right">2并发</td>
<td class="right">4并发</td>
<td class="right">8并发</td>
<td class="right">16并发</td>
<td class="right">32并发</td>
<td class="right">64 并发</td>
<td class="right">128并发</td>
<td class="right">256并发</td>
</tr>

<tr>
<td class="left">发送总请求数</td>
<td class="right">21161</td>
<td class="right">36094</td>
<td class="right">41150</td>
<td class="right">41831</td>
<td class="right">41700</td>
<td class="right">41612</td>
<td class="right">41564</td>
<td class="right">41418</td>
<td class="right">41299</td>
</tr>

<tr>
<td class="left">总时间(s)</td>
<td class="right">100</td>
<td class="right">100</td>
<td class="right">100</td>
<td class="right">100</td>
<td class="right">100</td>
<td class="right">100</td>
<td class="right">100</td>
<td class="right">100</td>
<td class="right">100</td>
</tr>

<tr>
<td class="left">平均请求时间(ms)</td>
<td class="right">4.726</td>
<td class="right">5.541</td>
<td class="right">9.722</td>
<td class="right">19.125</td>
<td class="right">38.381</td>
<td class="right">76.901</td>
<td class="right">153.980</td>
<td class="right">309.110</td>
<td class="right">619.883</td>
</tr>

<tr>
<td class="left">请求时间中位数（50%&lt;)(ms)</td>
<td class="right">4</td>
<td class="right">4</td>
<td class="right">6</td>
<td class="right">12</td>
<td class="right">28</td>
<td class="right">83</td>
<td class="right">149</td>
<td class="right">326</td>
<td class="right">639</td>
</tr>

<tr>
<td class="left">请求时间90%&lt; (ms)</td>
<td class="right">4</td>
<td class="right">6</td>
<td class="right">11</td>
<td class="right">51</td>
<td class="right">75</td>
<td class="right">122</td>
<td class="right">270</td>
<td class="right">519</td>
<td class="right">938</td>
</tr>

<tr>
<td class="left">最大请求时间(ms)</td>
<td class="right">1037</td>
<td class="right">1037</td>
<td class="right">1044</td>
<td class="right">1064</td>
<td class="right">1083</td>
<td class="right">1153</td>
<td class="right">1257</td>
<td class="right">1556</td>
<td class="right">2205</td>
</tr>

<tr>
<td class="left">Error</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
</tr>

<tr>
<td class="left">QPS(请求数/秒)</td>
<td class="right">211.61</td>
<td class="right">360.94</td>
<td class="right">411.50</td>
<td class="right">418.31</td>
<td class="right">416.87</td>
<td class="right">416.12</td>
<td class="right">415.64</td>
<td class="right">414.18</td>
<td class="right">412.99</td>
</tr>
</tbody>
</table>

<p>
并发上不去的原因在于：高并发下日志打印太慢
</p>
<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">
<caption class="t-above"><span class="table-number">Table 2:</span> 修改打印日志级别后</caption>

<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="left">指标</td>
<td class="right">1并发</td>
<td class="right">2并发</td>
<td class="right">4并发</td>
<td class="right">8并发</td>
<td class="right">16并发</td>
<td class="right">32并发</td>
<td class="right">64 并发</td>
<td class="right">128并发</td>
<td class="right">256并发</td>
</tr>

<tr>
<td class="left">发送总请求数</td>
<td class="right">23907</td>
<td class="right">47744</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">50000</td>
</tr>

<tr>
<td class="left">总时间(s)</td>
<td class="right">100</td>
<td class="right">100</td>
<td class="right">54.205</td>
<td class="right">65.171</td>
<td class="right">42.477</td>
<td class="right">26.819</td>
<td class="right">23.859</td>
<td class="right">23.820</td>
<td class="right">23.424</td>
</tr>

<tr>
<td class="left">平均请求时间(ms)</td>
<td class="right">4.190</td>
<td class="right">4.189</td>
<td class="right">4.336</td>
<td class="right">10.427</td>
<td class="right">13.593</td>
<td class="right">17.164</td>
<td class="right">30.540</td>
<td class="right">60.978</td>
<td class="right">119.929</td>
</tr>

<tr>
<td class="left">请求时间中位数（50%&lt;)(ms)</td>
<td class="right">3</td>
<td class="right">3</td>
<td class="right">3</td>
<td class="right">4</td>
<td class="right">6</td>
<td class="right">10</td>
<td class="right">13</td>
<td class="right">20</td>
<td class="right">49</td>
</tr>

<tr>
<td class="left">请求时间90%&lt; (ms)</td>
<td class="right">6</td>
<td class="right">6</td>
<td class="right">6</td>
<td class="right">11</td>
<td class="right">41</td>
<td class="right">35</td>
<td class="right">75</td>
<td class="right">159</td>
<td class="right">190</td>
</tr>

<tr>
<td class="left">最大请求时间(ms)</td>
<td class="right">1040</td>
<td class="right">1037</td>
<td class="right">1033</td>
<td class="right">1074</td>
<td class="right">1038</td>
<td class="right">1070</td>
<td class="right">1100</td>
<td class="right">2099</td>
<td class="right">1672</td>
</tr>

<tr>
<td class="left">Error</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
</tr>

<tr>
<td class="left">QPS</td>
<td class="right">238.69</td>
<td class="right">477.44</td>
<td class="right">922.43</td>
<td class="right">767.22</td>
<td class="right">1177.10</td>
<td class="right">1864.35</td>
<td class="right">2095.63</td>
<td class="right">2099.10</td>
<td class="right">2134.60</td>
</tr>
</tbody>
</table>
</div>
</div>
