src/zuul/single_test.org
** 自动注册应用提供hello world服务，无auth认证
   
   #+CAPTION: 直接访问api key management应用hello world服务
   #+ATTR_HTML: :border 1 :rules all :frame boader
   | 指标                      |   1并发 |  2并发 |  4并发 |  8并发 |  16并发 |  32并发 | 64 并发 | 128并发 | 256并发 |
   | 发送总请求数              |   32820 |  50000 |  50000 |  50000 |   50000 |   50000 |   50000 |   50000 |   50000 |
   | 总时间(s)                 | 100.915 | 79.015 | 52.931 | 65.635 |  38.096 |  24.777 |  23.970 |  23.884 |  24.870 |
   | 平均请求时间(ms)          |   3.075 |  3.161 |  4.235 | 10.502 |  12.191 |  15.857 |  30.682 |  61.142 | 127.334 |
   | 请求时间中位数（50%<)(ms) |       3 |      3 |      3 |      3 |       5 |       7 |       9 |      14 |      41 |
   | 请求时间90%< (ms)         |       3 |      4 |      4 |     20 |      31 |      36 |      80 |     171 |     309 |
   | 最大请求时间(ms)          |    1035 |   1035 |   1036 |   1057 |    1036 |    1064 |    1068 |    1211 |    1913 |
   | Error                     |       0 |      0 |      0 |      0 |       0 |       0 |       0 |       0 |       0 |
   | QPS(请求数/秒)            |  325.23 | 632.79 | 944.62 | 761.79 | 1312.49 | 2018.03 | 2085.91 | 2093.48 | 2010.47 |
   
      #+BEGIN_SRC sh
    ab -t 100 -c 1 http://172.25.17.74:7070/akm-service/apiKey/hw 
    ab -t 100 -c 2 http://172.25.17.74:7070/akm-service/apiKey/hw 
    ab -t 100 -c 4 http://172.25.17.74:7070/akm-service/apiKey/hw 
    ab -t 100 -c 8 http://172.25.17.74:7070/akm-service/apiKey/hw 
    ab -t 100 -c 16 http://172.25.17.74:7070/akm-service/apiKey/hw 
    ab -t 100 -c 32 http://172.25.17.74:7070/akm-service/apiKey/hw 
    ab -t 100 -c 64 http://172.25.17.74:7070/akm-service/apiKey/hw 
    ab -t 100 -c 128 http://172.25.17.74:7070/akm-service/apiKey/hw 
    ab -t 100 -c 256 http://172.25.17.74:7070/akm-service/apiKey/hw
   #+END_SRC
   
   #+CAPTION: 通过网关访问自动注册的api key management应用hello world服务
   #+ATTR_HTML: :border 1 :rules all :frame boader
   | 指标                      |   1并发 |   2并发 |   4并发 |   8并发 | 16并发 | 32并发 | 64 并发 | 128并发 |  256并发 |
   | 发送总请求数              |   14310 |   40219 |   43953 |   41921 |  50000 |  50000 |   50000 |   41020 |    11363 |
   | 总时间(s)                 | 100.001 | 100.001 | 100.001 | 100.024 | 86.916 | 49.743 |  45.481 | 103.918 |  101.969 |
   | 平均请求时间(ms)          |   6.988 |   4.973 |   9.101 |  19.088 | 27.813 | 31.835 |  58.216 | 324.269 | 2297.280 |
   | 请求时间中位数（50%<)(ms) |       6 |       5 |       5 |       7 |     11 |     15 |      23 |      27 |       67 |
   | 请求时间90%< (ms)         |       9 |       6 |       8 |      73 |     77 |     77 |     130 |     370 |     5633 |
   | 最大请求时间(ms)          |    1026 |    1025 |    1036 |    1029 |   1108 |   1091 |    2386 |    5610 |    16258 |
   | Error                     |       0 |       0 |       0 |       0 |      0 |      0 |       0 |     106 |        7 |
   | QPS(请求数/秒)            |  143.10 |  402.19 |  439.53 |  419.11 | 575.27 | 656.70 | 1099.35 |  394.73 |   111.44 |
   
   并发超过100以后，发现后台服务无法获得信号量，产生熔断异常
   
   #+BEGIN_SRC
  hystrix.command.default.execution.isolation.strategy=SEMAPHORE
  hystrix.command.default.execution.isolation.semaphore.maxConcurrentRequests=100000
  hystrix.command.default.execution.timeout.enabled=false
  hystrix.command.default.execution.isolation.thread.timeoutInMilliseconds=20000
   #+END_SRC
   
   #+CAPTION: 增加熔断信号量配置
   #+ATTR_HTML: :border 1 :rules all :frame boader
   | 指标                      |   1并发 |   2并发 |   4并发 |   8并发 | 16并发 |  32并发 | 64 并发 | 128并发 | 256并发 |
   | 发送总请求数              |   17057 |   40571 |   43521 |   41810 |  50000 |   50000 |   50000 |   50000 |   50000 |
   | 总时间(s)                 | 100.000 | 100.002 | 100.045 | 100.063 | 86.713 |  49.131 |  43.806 |  42.358 |  44.288 |
   | 平均请求时间(ms)          |   5.863 |   4.930 |   9.195 |  19.146 | 27.748 |  31.444 |  56.071 | 108.437 | 226.755 |
   | 请求时间中位数（50%<)(ms) |       5 |       4 |       5 |       6 |     10 |      15 |      21 |      42 |      60 |
   | 请求时间90%< (ms)         |       7 |       5 |       8 |      74 |     79 |      75 |     134 |     295 |     651 |
   | 最大请求时间(ms)          |    1032 |    1036 |    1029 |    1106 |   1098 |    1200 |    2178 |    3030 |    4115 |
   | Error                     |       0 |       0 |       0 |       0 |      0 |       0 |       0 |       0 |       0 |
   | QPS(请求数/秒)            |  170.57 |  405.70 |  435.01 |  417.84 | 576.62 | 1017.70 | 1141.41 | 1180.41 | 1128.97 |

经过网关路由后QPS下降了一半   
