html/zuul/single_test.html

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">自动注册应用提供hello world服务，无auth认证</h3>
<div class="outline-text-3" id="text-2-2">
<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">
<caption class="t-above"><span class="table-number">Table 3:</span> 直接访问api key management应用hello world服务</caption>

<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="left">指标</td>
<td class="right">1并发</td>
<td class="right">2并发</td>
<td class="right">4并发</td>
<td class="right">8并发</td>
<td class="right">16并发</td>
<td class="right">32并发</td>
<td class="right">64 并发</td>
<td class="right">128并发</td>
<td class="right">256并发</td>
</tr>

<tr>
<td class="left">发送总请求数</td>
<td class="right">32820</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">50000</td>
</tr>

<tr>
<td class="left">总时间(s)</td>
<td class="right">100.915</td>
<td class="right">79.015</td>
<td class="right">52.931</td>
<td class="right">65.635</td>
<td class="right">38.096</td>
<td class="right">24.777</td>
<td class="right">23.970</td>
<td class="right">23.884</td>
<td class="right">24.870</td>
</tr>

<tr>
<td class="left">平均请求时间(ms)</td>
<td class="right">3.075</td>
<td class="right">3.161</td>
<td class="right">4.235</td>
<td class="right">10.502</td>
<td class="right">12.191</td>
<td class="right">15.857</td>
<td class="right">30.682</td>
<td class="right">61.142</td>
<td class="right">127.334</td>
</tr>

<tr>
<td class="left">请求时间中位数（50%&lt;)(ms)</td>
<td class="right">3</td>
<td class="right">3</td>
<td class="right">3</td>
<td class="right">3</td>
<td class="right">5</td>
<td class="right">7</td>
<td class="right">9</td>
<td class="right">14</td>
<td class="right">41</td>
</tr>

<tr>
<td class="left">请求时间90%&lt; (ms)</td>
<td class="right">3</td>
<td class="right">4</td>
<td class="right">4</td>
<td class="right">20</td>
<td class="right">31</td>
<td class="right">36</td>
<td class="right">80</td>
<td class="right">171</td>
<td class="right">309</td>
</tr>

<tr>
<td class="left">最大请求时间(ms)</td>
<td class="right">1035</td>
<td class="right">1035</td>
<td class="right">1036</td>
<td class="right">1057</td>
<td class="right">1036</td>
<td class="right">1064</td>
<td class="right">1068</td>
<td class="right">1211</td>
<td class="right">1913</td>
</tr>

<tr>
<td class="left">Error</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
</tr>

<tr>
<td class="left">QPS(请求数/秒)</td>
<td class="right">325.23</td>
<td class="right">632.79</td>
<td class="right">944.62</td>
<td class="right">761.79</td>
<td class="right">1312.49</td>
<td class="right">2018.03</td>
<td class="right">2085.91</td>
<td class="right">2093.48</td>
<td class="right">2010.47</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-sh">ab -t 100 -c 1 http://172.25.17.74:7070/akm-service/apiKey/hw 
ab -t 100 -c 2 http://172.25.17.74:7070/akm-service/apiKey/hw 
ab -t 100 -c 4 http://172.25.17.74:7070/akm-service/apiKey/hw 
ab -t 100 -c 8 http://172.25.17.74:7070/akm-service/apiKey/hw 
ab -t 100 -c 16 http://172.25.17.74:7070/akm-service/apiKey/hw 
ab -t 100 -c 32 http://172.25.17.74:7070/akm-service/apiKey/hw 
ab -t 100 -c 64 http://172.25.17.74:7070/akm-service/apiKey/hw 
ab -t 100 -c 128 http://172.25.17.74:7070/akm-service/apiKey/hw 
ab -t 100 -c 256 http://172.25.17.74:7070/akm-service/apiKey/hw
</pre>
</div>

<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">
<caption class="t-above"><span class="table-number">Table 4:</span> 通过网关访问自动注册的api key management应用hello world服务</caption>

<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="left">指标</td>
<td class="right">1并发</td>
<td class="right">2并发</td>
<td class="right">4并发</td>
<td class="right">8并发</td>
<td class="right">16并发</td>
<td class="right">32并发</td>
<td class="right">64 并发</td>
<td class="right">128并发</td>
<td class="right">256并发</td>
</tr>

<tr>
<td class="left">发送总请求数</td>
<td class="right">14310</td>
<td class="right">40219</td>
<td class="right">43953</td>
<td class="right">41921</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">41020</td>
<td class="right">11363</td>
</tr>

<tr>
<td class="left">总时间(s)</td>
<td class="right">100.001</td>
<td class="right">100.001</td>
<td class="right">100.001</td>
<td class="right">100.024</td>
<td class="right">86.916</td>
<td class="right">49.743</td>
<td class="right">45.481</td>
<td class="right">103.918</td>
<td class="right">101.969</td>
</tr>

<tr>
<td class="left">平均请求时间(ms)</td>
<td class="right">6.988</td>
<td class="right">4.973</td>
<td class="right">9.101</td>
<td class="right">19.088</td>
<td class="right">27.813</td>
<td class="right">31.835</td>
<td class="right">58.216</td>
<td class="right">324.269</td>
<td class="right">2297.280</td>
</tr>

<tr>
<td class="left">请求时间中位数（50%&lt;)(ms)</td>
<td class="right">6</td>
<td class="right">5</td>
<td class="right">5</td>
<td class="right">7</td>
<td class="right">11</td>
<td class="right">15</td>
<td class="right">23</td>
<td class="right">27</td>
<td class="right">67</td>
</tr>

<tr>
<td class="left">请求时间90%&lt; (ms)</td>
<td class="right">9</td>
<td class="right">6</td>
<td class="right">8</td>
<td class="right">73</td>
<td class="right">77</td>
<td class="right">77</td>
<td class="right">130</td>
<td class="right">370</td>
<td class="right">5633</td>
</tr>

<tr>
<td class="left">最大请求时间(ms)</td>
<td class="right">1026</td>
<td class="right">1025</td>
<td class="right">1036</td>
<td class="right">1029</td>
<td class="right">1108</td>
<td class="right">1091</td>
<td class="right">2386</td>
<td class="right">5610</td>
<td class="right">16258</td>
</tr>

<tr>
<td class="left">Error</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">106</td>
<td class="right">7</td>
</tr>

<tr>
<td class="left">QPS(请求数/秒)</td>
<td class="right">143.10</td>
<td class="right">402.19</td>
<td class="right">439.53</td>
<td class="right">419.11</td>
<td class="right">575.27</td>
<td class="right">656.70</td>
<td class="right">1099.35</td>
<td class="right">394.73</td>
<td class="right">111.44</td>
</tr>
</tbody>
</table>

<p>
并发超过100以后，发现后台服务无法获得信号量，产生熔断异常
</p>

<pre class="example">
hystrix.command.default.execution.isolation.strategy=SEMAPHORE
hystrix.command.default.execution.isolation.semaphore.maxConcurrentRequests=100000
hystrix.command.default.execution.timeout.enabled=false
hystrix.command.default.execution.isolation.thread.timeoutInMilliseconds=20000
</pre>

<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">
<caption class="t-above"><span class="table-number">Table 5:</span> 增加熔断信号量配置</caption>

<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="left">指标</td>
<td class="right">1并发</td>
<td class="right">2并发</td>
<td class="right">4并发</td>
<td class="right">8并发</td>
<td class="right">16并发</td>
<td class="right">32并发</td>
<td class="right">64 并发</td>
<td class="right">128并发</td>
<td class="right">256并发</td>
</tr>

<tr>
<td class="left">发送总请求数</td>
<td class="right">17057</td>
<td class="right">40571</td>
<td class="right">43521</td>
<td class="right">41810</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">50000</td>
</tr>

<tr>
<td class="left">总时间(s)</td>
<td class="right">100.000</td>
<td class="right">100.002</td>
<td class="right">100.045</td>
<td class="right">100.063</td>
<td class="right">86.713</td>
<td class="right">49.131</td>
<td class="right">43.806</td>
<td class="right">42.358</td>
<td class="right">44.288</td>
</tr>

<tr>
<td class="left">平均请求时间(ms)</td>
<td class="right">5.863</td>
<td class="right">4.930</td>
<td class="right">9.195</td>
<td class="right">19.146</td>
<td class="right">27.748</td>
<td class="right">31.444</td>
<td class="right">56.071</td>
<td class="right">108.437</td>
<td class="right">226.755</td>
</tr>

<tr>
<td class="left">请求时间中位数（50%&lt;)(ms)</td>
<td class="right">5</td>
<td class="right">4</td>
<td class="right">5</td>
<td class="right">6</td>
<td class="right">10</td>
<td class="right">15</td>
<td class="right">21</td>
<td class="right">42</td>
<td class="right">60</td>
</tr>

<tr>
<td class="left">请求时间90%&lt; (ms)</td>
<td class="right">7</td>
<td class="right">5</td>
<td class="right">8</td>
<td class="right">74</td>
<td class="right">79</td>
<td class="right">75</td>
<td class="right">134</td>
<td class="right">295</td>
<td class="right">651</td>
</tr>

<tr>
<td class="left">最大请求时间(ms)</td>
<td class="right">1032</td>
<td class="right">1036</td>
<td class="right">1029</td>
<td class="right">1106</td>
<td class="right">1098</td>
<td class="right">1200</td>
<td class="right">2178</td>
<td class="right">3030</td>
<td class="right">4115</td>
</tr>

<tr>
<td class="left">Error</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
</tr>

<tr>
<td class="left">QPS(请求数/秒)</td>
<td class="right">170.57</td>
<td class="right">405.70</td>
<td class="right">435.01</td>
<td class="right">417.84</td>
<td class="right">576.62</td>
<td class="right">1017.70</td>
<td class="right">1141.41</td>
<td class="right">1180.41</td>
<td class="right">1128.97</td>
</tr>
</tbody>
</table>

<p>
经过网关路由后QPS下降了一半   
</p>
</div>
</div>
