src/zuul/single_test.org
** 自动注册应用提供hello world服务，oauth认证
   
   #+CAPTION: 通过网关访问自动注册的api key management应用hello world服务, oauth安全认证
   #+ATTR_HTML: :border 1 :rules all :frame boader
   | 指标                      |   1并发 |   2并发 |   4并发 |   8并发 |  16并发 |  32并发 | 64 并发 |  128并发 |  256并发 |
   | 发送总请求数              |    3497 |    6172 |   11120 |   12511 |   12580 |   12561 |   12513 |    12455 |    12278 |
   | 总时间(s)                 | 100.006 | 100.022 | 100.008 | 100.016 | 100.000 | 100.018 | 100.004 |  100.007 |  100.020 |
   | 平均请求时间(ms)          |  28.598 |  32.412 |  35.974 |  63.954 | 127.186 | 254.801 | 511.490 | 1027.768 | 2085.444 |
   | 请求时间中位数（50%<)(ms) |      28 |      31 |      34 |      62 |     127 |     258 |     523 |     1051 |     2105 |
   | 请求时间90%< (ms)         |      31 |      36 |      44 |      81 |     155 |     307 |     622 |     1248 |     2440 |
   | 最大请求时间(ms)          |     354 |    1053 |    1071 |    1108 |    1119 |    1307 |    1624 |     2207 |     3676 |
   | Error                     |       0 |       0 |       0 |       0 |       0 |       0 |       0 |        0 |        0 |
   | QPS(请求数/秒)            |   34.97 |   61.71 |  111.19 |  125.09 |  125.80 |  125.59 |  125.12 |   124.54 |   122.76 |
   
      #+BEGIN_SRC sh
    ab -H 'authorization: Bearer TGT-117-ei2eTUuee9OndJpbLqowydpby5esHe0qmX7adwDiRQMhCcfusc-cas01.example.org' -t 100 -c 1 http://172.25.17.74:7070/akm-service/apiKey/hw
    ab -H 'authorization: Bearer TGT-117-ei2eTUuee9OndJpbLqowydpby5esHe0qmX7adwDiRQMhCcfusc-cas01.example.org' -t 100 -c 2 http://172.25.17.74:7070/akm-service/apiKey/hw
    ab -H 'authorization: Bearer TGT-117-ei2eTUuee9OndJpbLqowydpby5esHe0qmX7adwDiRQMhCcfusc-cas01.example.org' -t 100 -c 4 http://172.25.17.74:7070/akm-service/apiKey/hw
    ab -H 'authorization: Bearer TGT-117-ei2eTUuee9OndJpbLqowydpby5esHe0qmX7adwDiRQMhCcfusc-cas01.example.org' -t 100 -c 8 http://172.25.17.74:7070/akm-service/apiKey/hw
    ab -H 'authorization: Bearer TGT-117-ei2eTUuee9OndJpbLqowydpby5esHe0qmX7adwDiRQMhCcfusc-cas01.example.org' -t 100 -c 16 http://172.25.17.74:7070/akm-service/apiKey/hw
    ab -H 'authorization: Bearer TGT-117-ei2eTUuee9OndJpbLqowydpby5esHe0qmX7adwDiRQMhCcfusc-cas01.example.org' -t 100 -c 32 http://172.25.17.74:7070/akm-service/apiKey/hw
    ab -H 'authorization: Bearer TGT-117-ei2eTUuee9OndJpbLqowydpby5esHe0qmX7adwDiRQMhCcfusc-cas01.example.org' -t 100 -c 64 http://172.25.17.74:7070/akm-service/apiKey/hw
    ab -H 'authorization: Bearer TGT-117-ei2eTUuee9OndJpbLqowydpby5esHe0qmX7adwDiRQMhCcfusc-cas01.example.org' -t 100 -c 128 http://172.25.17.74:7070/akm-service/apiKey/hw
    ab -H 'authorization: Bearer TGT-117-ei2eTUuee9OndJpbLqowydpby5esHe0qmX7adwDiRQMhCcfusc-cas01.example.org' -t 100 -c 256 http://172.25.17.74:7070/akm-service/apiKey/hw
   #+END_SRC

   #+CAPTION: redis中缓存oauth认证结果，有效期为1个小时
   #+ATTR_HTML: :border 1 :rules all :frame boader
   | 指标                      |   1并发 |   2并发 |   4并发 |   8并发 |  16并发 | 32并发 | 64 并发 | 128并发 | 256并发 |
   | 发送总请求数              |   14433 |   29669 |   48164 |   41777 |   49499 |  50000 |   50000 |   50000 |   50000 |
   | 总时间(s)                 | 100.000 | 100.000 | 100.043 | 100.000 | 100.000 | 57.528 |  49.028 |  45.796 |  48.216 |
   | 平均请求时间(ms)          |   6.929 |   6.741 |   8.309 |  19.149 |  32.324 | 36.818 |  62.756 | 117.238 | 246.865 |
   | 请求时间中位数（50%<)(ms) |       5 |       5 |       6 |       7 |      11 |     19 |      29 |      57 |     164 |
   | 请求时间90%< (ms)         |       6 |       6 |       7 |      66 |      79 |     88 |     144 |     304 |     571 |
   | 最大请求时间(ms)          |    1039 |    1034 |    1050 |    1085 |    3298 |   1131 |    1790 |    1959 |    3095 |
   | Error                     |       0 |       0 |       0 |       0 |       0 |      0 |       0 |       0 |       0 |
   | QPS(请求数/秒)            |  144.33 |  296.69 |  481.43 |  417.77 |  494.99 | 869.14 | 1019.82 | 1091.79 | 1037.00 |
   
   缓存安全认证结果后QPS相比无安全认证稍微有下降

** 数据库精确匹配路由hello world服务, 无auth认证
   
   #+CAPTION: 基于数据库配置路由hello world服务, 无auth认证
   #+ATTR_HTML: :border 1 :rules all :frame boader
   | 指标                      |   1并发 |   2并发 |   4并发 |   8并发 | 16并发 | 32并发 | 64 并发 | 128并发 | 256并发 |
   | 发送总请求数              |   20668 |   41126 |   44598 |   42008 |  50000 |  50000 |   50000 |   50000 |   50000 |
   | 总时间(s)                 | 100.002 | 100.002 | 100.002 | 100.004 | 90.788 | 52.921 |  46.244 |  45.292 |  40.550 |
   | 平均请求时间(ms)          |   4.839 |   4.863 |   8.969 |  19.045 | 29.052 | 33.870 |  59.192 | 115.946 | 207.616 |
   | 请求时间中位数（50%<)(ms) |       4 |       4 |       5 |       7 |     11 |     18 |      27 |      46 |     100 |
   | 请求时间90%< (ms)         |       5 |       5 |       8 |      70 |     79 |     81 |     141 |     265 |     582 |
   | 最大请求时间(ms)          |    1029 |    1026 |    1018 |    1031 |   1109 |   1116 |    2573 |    4056 |    3666 |
   | Error                     |       0 |       0 |       2 |       0 |      1 |      0 |       0 |       1 |       0 |
   | QPS(请求数/秒)            |  206.67 |  411.25 |  445.97 |  420.06 | 550.73 | 944.80 | 1081.23 | 1103.96 | 1233.05 |
   
** 数据库精确匹配路由hello world服务, 缓存Oauth认证结果
   
   #+CAPTION: 基于数据库配置路由hello world服务, 缓存Oauth认证结果
   #+ATTR_HTML: :border 1 :rules all :frame boader
   | 指标                      |   1并发 |   2并发 |   4并发 |   8并发 | 16并发 | 32并发 | 64 并发 | 128并发 | 256并发 |
   | 发送总请求数              |   17553 |   34038 |   45800 |   42053 |  50000 |  50000 |   50000 |   50000 |   50000 |
   | 总时间(s)                 | 100.000 | 100.002 | 100.001 | 100.006 | 97.159 | 57.970 |  47.910 |  42.522 |  39.128 |
   | 平均请求时间(ms)          |   5.697 |   5.876 |   8.734 |  19.025 | 31.091 | 37.101 |  61.325 | 108.857 | 200.337 |
   | 请求时间中位数（50%<)(ms) |       5 |       5 |       6 |       8 |     13 |     21 |      33 |      56 |     126 |
   | 请求时间90%< (ms)         |       6 |       6 |       9 |      67 |     79 |     83 |     141 |     262 |     488 |
   | 最大请求时间(ms)          |    1013 |    1033 |     214 |    1031 |   1060 |   1064 |    1921 |    1683 |    2851 |
   | Error                     |       0 |       0 |       0 |       0 |      0 |      0 |       0 |       3 |       2 |
   | QPS(请求数/秒)            |  175.53 |  340.37 |  458.00 |  420.50 | 514.62 | 862.52 | 1043.62 | 1175.85 | 1277.85 |
   
