html/zuul/single_test.html
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">自动注册应用提供hello world服务，oauth认证</h3>
<div class="outline-text-3" id="text-2-3">
<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">
<caption class="t-above"><span class="table-number">Table 6:</span> 通过网关访问自动注册的api key management应用hello world服务, oauth安全认证</caption>

<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="left">指标</td>
<td class="right">1并发</td>
<td class="right">2并发</td>
<td class="right">4并发</td>
<td class="right">8并发</td>
<td class="right">16并发</td>
<td class="right">32并发</td>
<td class="right">64 并发</td>
<td class="right">128并发</td>
<td class="right">256并发</td>
</tr>

<tr>
<td class="left">发送总请求数</td>
<td class="right">3497</td>
<td class="right">6172</td>
<td class="right">11120</td>
<td class="right">12511</td>
<td class="right">12580</td>
<td class="right">12561</td>
<td class="right">12513</td>
<td class="right">12455</td>
<td class="right">12278</td>
</tr>

<tr>
<td class="left">总时间(s)</td>
<td class="right">100.006</td>
<td class="right">100.022</td>
<td class="right">100.008</td>
<td class="right">100.016</td>
<td class="right">100.000</td>
<td class="right">100.018</td>
<td class="right">100.004</td>
<td class="right">100.007</td>
<td class="right">100.020</td>
</tr>

<tr>
<td class="left">平均请求时间(ms)</td>
<td class="right">28.598</td>
<td class="right">32.412</td>
<td class="right">35.974</td>
<td class="right">63.954</td>
<td class="right">127.186</td>
<td class="right">254.801</td>
<td class="right">511.490</td>
<td class="right">1027.768</td>
<td class="right">2085.444</td>
</tr>

<tr>
<td class="left">请求时间中位数（50%&lt;)(ms)</td>
<td class="right">28</td>
<td class="right">31</td>
<td class="right">34</td>
<td class="right">62</td>
<td class="right">127</td>
<td class="right">258</td>
<td class="right">523</td>
<td class="right">1051</td>
<td class="right">2105</td>
</tr>

<tr>
<td class="left">请求时间90%&lt; (ms)</td>
<td class="right">31</td>
<td class="right">36</td>
<td class="right">44</td>
<td class="right">81</td>
<td class="right">155</td>
<td class="right">307</td>
<td class="right">622</td>
<td class="right">1248</td>
<td class="right">2440</td>
</tr>

<tr>
<td class="left">最大请求时间(ms)</td>
<td class="right">354</td>
<td class="right">1053</td>
<td class="right">1071</td>
<td class="right">1108</td>
<td class="right">1119</td>
<td class="right">1307</td>
<td class="right">1624</td>
<td class="right">2207</td>
<td class="right">3676</td>
</tr>

<tr>
<td class="left">Error</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
</tr>

<tr>
<td class="left">QPS(请求数/秒)</td>
<td class="right">34.97</td>
<td class="right">61.71</td>
<td class="right">111.19</td>
<td class="right">125.09</td>
<td class="right">125.80</td>
<td class="right">125.59</td>
<td class="right">125.12</td>
<td class="right">124.54</td>
<td class="right">122.76</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-sh">ab -H <span style="color: #ffa07a;">'authorization: Bearer TGT-117-ei2eTUuee9OndJpbLqowydpby5esHe0qmX7adwDiRQMhCcfusc-cas01.example.org'</span> -t 100 -c 1 http://172.25.17.74:7070/akm-service/apiKey/hw
ab -H <span style="color: #ffa07a;">'authorization: Bearer TGT-117-ei2eTUuee9OndJpbLqowydpby5esHe0qmX7adwDiRQMhCcfusc-cas01.example.org'</span> -t 100 -c 2 http://172.25.17.74:7070/akm-service/apiKey/hw
ab -H <span style="color: #ffa07a;">'authorization: Bearer TGT-117-ei2eTUuee9OndJpbLqowydpby5esHe0qmX7adwDiRQMhCcfusc-cas01.example.org'</span> -t 100 -c 4 http://172.25.17.74:7070/akm-service/apiKey/hw
ab -H <span style="color: #ffa07a;">'authorization: Bearer TGT-117-ei2eTUuee9OndJpbLqowydpby5esHe0qmX7adwDiRQMhCcfusc-cas01.example.org'</span> -t 100 -c 8 http://172.25.17.74:7070/akm-service/apiKey/hw
ab -H <span style="color: #ffa07a;">'authorization: Bearer TGT-117-ei2eTUuee9OndJpbLqowydpby5esHe0qmX7adwDiRQMhCcfusc-cas01.example.org'</span> -t 100 -c 16 http://172.25.17.74:7070/akm-service/apiKey/hw
ab -H <span style="color: #ffa07a;">'authorization: Bearer TGT-117-ei2eTUuee9OndJpbLqowydpby5esHe0qmX7adwDiRQMhCcfusc-cas01.example.org'</span> -t 100 -c 32 http://172.25.17.74:7070/akm-service/apiKey/hw
ab -H <span style="color: #ffa07a;">'authorization: Bearer TGT-117-ei2eTUuee9OndJpbLqowydpby5esHe0qmX7adwDiRQMhCcfusc-cas01.example.org'</span> -t 100 -c 64 http://172.25.17.74:7070/akm-service/apiKey/hw
ab -H <span style="color: #ffa07a;">'authorization: Bearer TGT-117-ei2eTUuee9OndJpbLqowydpby5esHe0qmX7adwDiRQMhCcfusc-cas01.example.org'</span> -t 100 -c 128 http://172.25.17.74:7070/akm-service/apiKey/hw
ab -H <span style="color: #ffa07a;">'authorization: Bearer TGT-117-ei2eTUuee9OndJpbLqowydpby5esHe0qmX7adwDiRQMhCcfusc-cas01.example.org'</span> -t 100 -c 256 http://172.25.17.74:7070/akm-service/apiKey/hw
</pre>
</div>

<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">
<caption class="t-above"><span class="table-number">Table 7:</span> redis中缓存oauth认证结果，有效期为1个小时</caption>

<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="left">指标</td>
<td class="right">1并发</td>
<td class="right">2并发</td>
<td class="right">4并发</td>
<td class="right">8并发</td>
<td class="right">16并发</td>
<td class="right">32并发</td>
<td class="right">64 并发</td>
<td class="right">128并发</td>
<td class="right">256并发</td>
</tr>

<tr>
<td class="left">发送总请求数</td>
<td class="right">14433</td>
<td class="right">29669</td>
<td class="right">48164</td>
<td class="right">41777</td>
<td class="right">49499</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">50000</td>
</tr>

<tr>
<td class="left">总时间(s)</td>
<td class="right">100.000</td>
<td class="right">100.000</td>
<td class="right">100.043</td>
<td class="right">100.000</td>
<td class="right">100.000</td>
<td class="right">57.528</td>
<td class="right">49.028</td>
<td class="right">45.796</td>
<td class="right">48.216</td>
</tr>

<tr>
<td class="left">平均请求时间(ms)</td>
<td class="right">6.929</td>
<td class="right">6.741</td>
<td class="right">8.309</td>
<td class="right">19.149</td>
<td class="right">32.324</td>
<td class="right">36.818</td>
<td class="right">62.756</td>
<td class="right">117.238</td>
<td class="right">246.865</td>
</tr>

<tr>
<td class="left">请求时间中位数（50%&lt;)(ms)</td>
<td class="right">5</td>
<td class="right">5</td>
<td class="right">6</td>
<td class="right">7</td>
<td class="right">11</td>
<td class="right">19</td>
<td class="right">29</td>
<td class="right">57</td>
<td class="right">164</td>
</tr>

<tr>
<td class="left">请求时间90%&lt; (ms)</td>
<td class="right">6</td>
<td class="right">6</td>
<td class="right">7</td>
<td class="right">66</td>
<td class="right">79</td>
<td class="right">88</td>
<td class="right">144</td>
<td class="right">304</td>
<td class="right">571</td>
</tr>

<tr>
<td class="left">最大请求时间(ms)</td>
<td class="right">1039</td>
<td class="right">1034</td>
<td class="right">1050</td>
<td class="right">1085</td>
<td class="right">3298</td>
<td class="right">1131</td>
<td class="right">1790</td>
<td class="right">1959</td>
<td class="right">3095</td>
</tr>

<tr>
<td class="left">Error</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
</tr>

<tr>
<td class="left">QPS(请求数/秒)</td>
<td class="right">144.33</td>
<td class="right">296.69</td>
<td class="right">481.43</td>
<td class="right">417.77</td>
<td class="right">494.99</td>
<td class="right">869.14</td>
<td class="right">1019.82</td>
<td class="right">1091.79</td>
<td class="right">1037.00</td>
</tr>
</tbody>
</table>

<p>
缓存安全认证结果后QPS相比无安全认证稍微有下降
</p>
</div>
</div>
