src/zuul/single_test.org
** 数据库模糊路径匹配路由hello world服务, 缓存Oauth认证结果
   
   #+CAPTION: 数据库路径模糊匹配hello world服务, 缓存Oauth认证结果
   #+ATTR_HTML: :border 1 :rules all :frame boader
   | 指标                      |   1并发 |   2并发 |   4并发 |   8并发 | 16并发 | 32并发 | 64 并发 | 128并发 | 256并发 |
   | 发送总请求数              |   16424 |   32172 |   46472 |   42636 |  50000 |  50000 |   50000 |   50000 |   50000 |
   | 总时间(s)                 | 100.001 | 100.004 | 100.000 | 100.026 | 97.788 | 61.316 |  48.973 |  42.492 |  40.519 |
   | 平均请求时间(ms)          |   6.089 |   6.217 |   8.607 |  18.768 | 31.292 | 39.242 |  62.685 | 108.780 | 207.459 |
   | 请求时间中位数（50%<)(ms) |       6 |       6 |       6 |       8 |     13 |     22 |      34 |      60 |     126 |
   | 请求时间90%< (ms)         |       6 |       7 |       8 |      65 |     79 |     87 |     141 |     256 |     500 |
   | 最大请求时间(ms)          |    1022 |    1034 |    1037 |    1041 |   1034 |   1452 |    2420 |    1325 |    3832 |
   | Error                     |       0 |       0 |       0 |       1 |      0 |      0 |       0 |       0 |       2 |
   | QPS(请求数/秒)            |  164.24 |  321.71 |  464.72 |  426.25 | 511.31 | 815.45 | 1020.98 | 1176.69 | 1233.98 |
   
   基于数据库配置的路由和自动注册的应用QPS差不多

* 业务应用测试 
每次API调用返回数据量7936 bytes 
** 直接调用后台/portal/products  
   #+BEGIN_SRC sh
    ab -t 100 -c 20 http://172.25.12.81:6000/portal/products
    ab -t 100 -c 50 http://172.25.12.81:6000/portal/products
    ab -t 100 -c 100 http://172.25.12.81:6000/portal/products
    ab -t 100 -c 200 http://172.25.12.81:6000/portal/products
    ab -t 100 -c 300 http://172.25.12.81:6000/portal/products
    ab -t 100 -c 500 http://172.25.12.81:6000/portal/products
    ab -t 100 -c 1000 http://172.25.12.81:6000/portal/products
   #+END_SRC
   
   #+CAPTION: 直接调用后台/portal/products
   #+ATTR_HTML: :border 1 :rules all :frame boader
   | 指标                      | 20 并发 | 50并发 | 100 并发 | 200 并发 | 300并发 | 500并发 | 1000并发 |
   | 发送总请求数              |   50000 |  50000 |    50000 |    50000 |   50000 |   50000 |    50000 |
   | 总时间(s)                 |  78.843 | 71.038 |   60.544 |   53.550 |  45.478 |  43.113 |   38.173 |
   | 平均请求时间(ms)          |  31.537 | 71.038 |  121.087 |  214.200 | 272.871 | 431.132 |  763.462 |
   | 请求时间中位数（50%<)(ms) |      28 |     66 |      121 |      232 |     283 |     464 |      851 |
   | 请求时间90%< (ms)         |      50 |    112 |      199 |      351 |     440 |     700 |     1220 |
   | 最大请求时间(ms)          |    1065 |   1137 |     1123 |     1373 |    1720 |    4223 |     4593 |
   | Error                     |       0 |      0 |        0 |        0 |       0 |       0 |        0 |
   | QPS(请求数/秒)            |  634.17 | 703.85 |   825.85 |   933.71 | 1099.42 | 1159.74 |  1309.82 |
** 网关优化前调用/portal/products
   #+BEGIN_SRC sh
    ab -t 100 -c 20 -H "Authorization: Bearer TGT-156-g7eqzcM5fY167ueeyCuJGSRljrEslehswfY52rjlwX2yQErrx4-cas01.example.org" http://172.25.12.81:7070/portal/products
    ab -t 100 -c 50  -H "Authorization: Bearer TGT-156-g7eqzcM5fY167ueeyCuJGSRljrEslehswfY52rjlwX2yQErrx4-cas01.example.org" http://172.25.12.81:7070/portal/products
    ab -t 100 -c 100  -H "Authorization: Bearer TGT-156-g7eqzcM5fY167ueeyCuJGSRljrEslehswfY52rjlwX2yQErrx4-cas01.example.org" http://172.25.12.81:7070/portal/products
    ab -t 100 -c 200  -H "Authorization: Bearer TGT-156-g7eqzcM5fY167ueeyCuJGSRljrEslehswfY52rjlwX2yQErrx4-cas01.example.org" http://172.25.12.81:7070/portal/products
   #+END_SRC
   
   #+CAPTION: 81环境网关路由后台/portal/products
   #+ATTR_HTML: :border 1 :rules all :frame boader
   | 指标                      | 20 并发 |  50并发 | 100 并发 | 200 并发 |
   | 发送总请求数              |    7805 |    8087 |     8001 |     8069 |
   | 总时间(s)                 | 100.010 | 100.041 |  100.018 |  100.098 |
   | 平均请求时间(ms)          | 256.273 | 618.529 | 1250.069 | 2481.047 |
   | 请求时间中位数（50%<)(ms) |     243 |     596 |     1211 |     2400 |
   | 请求时间90%< (ms)         |     371 |    1029 |     1897 |     3807 |
   | 最大请求时间(ms)          |     915 |    1704 |     3908 |     6246 |
   | Error                     |       0 |       0 |        0 |        0 |
   | QPS(请求数/秒)            |   78.04 |   80.84 |    80.00 |    80.61 |

