html/zuul/single_test.html

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7">数据库模糊路径匹配路由hello world服务, 缓存Oauth认证结果</h3>
<div class="outline-text-3" id="text-2-7">
<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">
<caption class="t-above"><span class="table-number">Table 11:</span> 数据库路径模糊匹配hello world服务, 缓存Oauth认证结果</caption>

<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="left">指标</td>
<td class="right">1并发</td>
<td class="right">2并发</td>
<td class="right">4并发</td>
<td class="right">8并发</td>
<td class="right">16并发</td>
<td class="right">32并发</td>
<td class="right">64 并发</td>
<td class="right">128并发</td>
<td class="right">256并发</td>
</tr>

<tr>
<td class="left">发送总请求数</td>
<td class="right">16424</td>
<td class="right">32172</td>
<td class="right">46472</td>
<td class="right">42636</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">50000</td>
</tr>

<tr>
<td class="left">总时间(s)</td>
<td class="right">100.001</td>
<td class="right">100.004</td>
<td class="right">100.000</td>
<td class="right">100.026</td>
<td class="right">97.788</td>
<td class="right">61.316</td>
<td class="right">48.973</td>
<td class="right">42.492</td>
<td class="right">40.519</td>
</tr>

<tr>
<td class="left">平均请求时间(ms)</td>
<td class="right">6.089</td>
<td class="right">6.217</td>
<td class="right">8.607</td>
<td class="right">18.768</td>
<td class="right">31.292</td>
<td class="right">39.242</td>
<td class="right">62.685</td>
<td class="right">108.780</td>
<td class="right">207.459</td>
</tr>

<tr>
<td class="left">请求时间中位数（50%&lt;)(ms)</td>
<td class="right">6</td>
<td class="right">6</td>
<td class="right">6</td>
<td class="right">8</td>
<td class="right">13</td>
<td class="right">22</td>
<td class="right">34</td>
<td class="right">60</td>
<td class="right">126</td>
</tr>

<tr>
<td class="left">请求时间90%&lt; (ms)</td>
<td class="right">6</td>
<td class="right">7</td>
<td class="right">8</td>
<td class="right">65</td>
<td class="right">79</td>
<td class="right">87</td>
<td class="right">141</td>
<td class="right">256</td>
<td class="right">500</td>
</tr>

<tr>
<td class="left">最大请求时间(ms)</td>
<td class="right">1022</td>
<td class="right">1034</td>
<td class="right">1037</td>
<td class="right">1041</td>
<td class="right">1034</td>
<td class="right">1452</td>
<td class="right">2420</td>
<td class="right">1325</td>
<td class="right">3832</td>
</tr>

<tr>
<td class="left">Error</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">1</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">2</td>
</tr>

<tr>
<td class="left">QPS(请求数/秒)</td>
<td class="right">164.24</td>
<td class="right">321.71</td>
<td class="right">464.72</td>
<td class="right">426.25</td>
<td class="right">511.31</td>
<td class="right">815.45</td>
<td class="right">1020.98</td>
<td class="right">1176.69</td>
<td class="right">1233.98</td>
</tr>
</tbody>
</table>

<p>
基于数据库配置的路由和自动注册的应用QPS差不多
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">业务应用测试</h2>
<div class="outline-text-2" id="text-3">
<p>
每次API调用返回数据量7936 bytes 
</p>
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">直接调用后台/portal/products</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-sh">ab -t 100 -c 20 http://172.25.12.81:6000/portal/products
ab -t 100 -c 50 http://172.25.12.81:6000/portal/products
ab -t 100 -c 100 http://172.25.12.81:6000/portal/products
ab -t 100 -c 200 http://172.25.12.81:6000/portal/products
ab -t 100 -c 300 http://172.25.12.81:6000/portal/products
ab -t 100 -c 500 http://172.25.12.81:6000/portal/products
ab -t 100 -c 1000 http://172.25.12.81:6000/portal/products
</pre>
</div>

<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">
<caption class="t-above"><span class="table-number">Table 12:</span> 直接调用后台/portal/products</caption>

<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="left">指标</td>
<td class="right">20 并发</td>
<td class="right">50并发</td>
<td class="right">100 并发</td>
<td class="right">200 并发</td>
<td class="right">300并发</td>
<td class="right">500并发</td>
<td class="right">1000并发</td>
</tr>

<tr>
<td class="left">发送总请求数</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">50000</td>
<td class="right">50000</td>
</tr>

<tr>
<td class="left">总时间(s)</td>
<td class="right">78.843</td>
<td class="right">71.038</td>
<td class="right">60.544</td>
<td class="right">53.550</td>
<td class="right">45.478</td>
<td class="right">43.113</td>
<td class="right">38.173</td>
</tr>

<tr>
<td class="left">平均请求时间(ms)</td>
<td class="right">31.537</td>
<td class="right">71.038</td>
<td class="right">121.087</td>
<td class="right">214.200</td>
<td class="right">272.871</td>
<td class="right">431.132</td>
<td class="right">763.462</td>
</tr>

<tr>
<td class="left">请求时间中位数（50%&lt;)(ms)</td>
<td class="right">28</td>
<td class="right">66</td>
<td class="right">121</td>
<td class="right">232</td>
<td class="right">283</td>
<td class="right">464</td>
<td class="right">851</td>
</tr>

<tr>
<td class="left">请求时间90%&lt; (ms)</td>
<td class="right">50</td>
<td class="right">112</td>
<td class="right">199</td>
<td class="right">351</td>
<td class="right">440</td>
<td class="right">700</td>
<td class="right">1220</td>
</tr>

<tr>
<td class="left">最大请求时间(ms)</td>
<td class="right">1065</td>
<td class="right">1137</td>
<td class="right">1123</td>
<td class="right">1373</td>
<td class="right">1720</td>
<td class="right">4223</td>
<td class="right">4593</td>
</tr>

<tr>
<td class="left">Error</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
</tr>

<tr>
<td class="left">QPS(请求数/秒)</td>
<td class="right">634.17</td>
<td class="right">703.85</td>
<td class="right">825.85</td>
<td class="right">933.71</td>
<td class="right">1099.42</td>
<td class="right">1159.74</td>
<td class="right">1309.82</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">网关优化前调用/portal/products</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">

<pre class="src src-sh">ab -t 100 -c 20 -H <span style="color: #ffa07a;">"Authorization: Bearer TGT-156-g7eqzcM5fY167ueeyCuJGSRljrEslehswfY52rjlwX2yQErrx4-cas01.example.org"</span> http://172.25.12.81:7070/portal/products
ab -t 100 -c 50  -H <span style="color: #ffa07a;">"Authorization: Bearer TGT-156-g7eqzcM5fY167ueeyCuJGSRljrEslehswfY52rjlwX2yQErrx4-cas01.example.org"</span> http://172.25.12.81:7070/portal/products
ab -t 100 -c 100  -H <span style="color: #ffa07a;">"Authorization: Bearer TGT-156-g7eqzcM5fY167ueeyCuJGSRljrEslehswfY52rjlwX2yQErrx4-cas01.example.org"</span> http://172.25.12.81:7070/portal/products
ab -t 100 -c 200  -H <span style="color: #ffa07a;">"Authorization: Bearer TGT-156-g7eqzcM5fY167ueeyCuJGSRljrEslehswfY52rjlwX2yQErrx4-cas01.example.org"</span> http://172.25.12.81:7070/portal/products
</pre>
</div>

<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">
<caption class="t-above"><span class="table-number">Table 13:</span> 81环境网关路由后台/portal/products</caption>

<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="left">指标</td>
<td class="right">20 并发</td>
<td class="right">50并发</td>
<td class="right">100 并发</td>
<td class="right">200 并发</td>
</tr>

<tr>
<td class="left">发送总请求数</td>
<td class="right">7805</td>
<td class="right">8087</td>
<td class="right">8001</td>
<td class="right">8069</td>
</tr>

<tr>
<td class="left">总时间(s)</td>
<td class="right">100.010</td>
<td class="right">100.041</td>
<td class="right">100.018</td>
<td class="right">100.098</td>
</tr>

<tr>
<td class="left">平均请求时间(ms)</td>
<td class="right">256.273</td>
<td class="right">618.529</td>
<td class="right">1250.069</td>
<td class="right">2481.047</td>
</tr>

<tr>
<td class="left">请求时间中位数（50%&lt;)(ms)</td>
<td class="right">243</td>
<td class="right">596</td>
<td class="right">1211</td>
<td class="right">2400</td>
</tr>

<tr>
<td class="left">请求时间90%&lt; (ms)</td>
<td class="right">371</td>
<td class="right">1029</td>
<td class="right">1897</td>
<td class="right">3807</td>
</tr>

<tr>
<td class="left">最大请求时间(ms)</td>
<td class="right">915</td>
<td class="right">1704</td>
<td class="right">3908</td>
<td class="right">6246</td>
</tr>

<tr>
<td class="left">Error</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">0</td>
</tr>

<tr>
<td class="left">QPS(请求数/秒)</td>
<td class="right">78.04</td>
<td class="right">80.84</td>
<td class="right">80.00</td>
<td class="right">80.61</td>
</tr>
</tbody>
</table>
</div>
</div>
